In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
titanic = pd.read_csv('data/titanic.csv')

In [7]:
# 플롯
# 리플레이스
# 숫자 문자

In [15]:
titanic.groupby('pclass').mean()

        survived     sibsp     parch
pclass
1       0.619195  0.436533  0.365325
2       0.429603  0.393502  0.368231
3       0.255289  0.568406  0.400564

In [70]:
titanic['age'] = titanic['age'].replace(["?"],[None]).astype("float")

In [121]:
def range(s):
    return s.max()-s.min()
titanic.groupby('pclass')['age'].agg({'min','max',range})

          range     min   max
pclass
1       79.0833  0.9167  80.0
2       69.3333  0.6667  70.0
3       73.8333  0.1667  74.0

In [165]:
def minseok(y):
    return y.size-y.count()
titanic['age'].agg(minseok)
# 전체 사이즈에서 널을

263

# 아래 두가지 방법 소개

In [161]:
def fff(j):
    return j.size-j.count()
titanic.groupby('pclass')['age'].agg(fff)
# 성대님이 한 방법

pclass
1     39
2     16
3    208
Name: age, dtype: int64

In [166]:
titanic.groupby('pclass')['age'].size()-titanic.groupby('pclass')['age'].count()
# 재영님이 한 방법

pclass
1     39
2     16
3    208
Name: age, dtype: int64

# 명칭이 굉장히 중요하다.

In [195]:
titanic[titanic['pclass']==1]['age'].size-titanic[titanic['pclass']==1]['age'].count()

39

In [197]:
carstocks = pd.read_csv('data/car_stocks.csv')

In [210]:
carstocks.groupby('Symbol')[['Open','Close']].agg({'min','max'})
# 자동차회사에서 시가와 종가의 각각 min,max값을 같이 구하는 방법이다.

              Open                   Close
               min         max         min         max
Symbol
GM       57.849998   64.330002   59.270000   64.610001
LCID     42.299999   56.200001   40.750000   55.520000
RIVN    106.750000  163.800003  100.730003  172.009995

In [211]:
carstocks.groupby('Symbol').agg({'Open':['min','max'],'Close':['min','max']})
# 애그에다가 콜론을 붙여서 지정해주는 방법이다.

              Open                   Close
               min         max         min         max
Symbol
GM       57.849998   64.330002   59.270000   64.610001
LCID     42.299999   56.200001   40.750000   55.520000
RIVN    106.750000  163.800003  100.730003  172.009995

In [269]:
def min_open(a):
    return a.min

carstocks.groupby('Symbol').agg(min_open=('Open','min'),max_open=('Open','max'),
                            min_close=('Close','min'),max_close=('Close','max'))

          min_open    max_open   min_close   max_close
Symbol
GM       57.849998   64.330002   59.270000   64.610001
LCID     42.299999   56.200001   40.750000   55.520000
RIVN    106.750000  163.800003  100.730003  172.009995

In [280]:
titanic.groupby('sex')['age'].mean()

sex
female    28.687071
male      30.585233
Name: age, dtype: float64

In [287]:
titanic.groupby(['sex','pclass','survived'])['age'].mean()

sex     pclass  survived
female  1       0           35.200000
                1           37.109375
        2       0           34.090909
                1           26.711051
        3       0           23.418750
                1           20.814815
male    1       0           43.658163
                1           36.168240
        2       0           33.092593
                1           17.449274
        3       0           26.679598
                1           22.436441
Name: age, dtype: float64